Revit 2024 API
FluidType.ClearAllTemperatures Method
 Clears all fluid temperatures in the set.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public void ClearAllTemperatures()
Visual Basic
Public Sub ClearAllTemperatures
Visual C++
public:
void ClearAllTemperatures()
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  Thrown if some temperatures in the FluidType object are in use.
See Also
FluidType Class
Autodesk.Revit.DB.Plumbing Namespace